src/test/java/comdao/eop/eop.集团_三码融合_物料资产目录分发反馈(主数据)/入参文件

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <Esb>
         <Route>
            <Sender>10.1208</Sender>
            <Time>20150601162000</Time>
            <ServCode>10.1120.SI_MDMSVR_MATC_IN_Asyn.AsynReq</ServCode>
            <MsgId>mdm_batch_changer_20150601162000</MsgId>
            <EsbId>a9f0528351d9696f66caf188d42b2902</EsbId>
         </Route>
      </Esb>
   </SOAP:Header>
   <SOAP:Body>
      <ns0:MT_MDM_MATC xmlns:ns0="urn:telecom:mss:jt:mdm">
         <ROOT>
            <PRDHA>10</PRDHA>
            <PRDHA_NAME>仪器仪表工具</PRDHA_NAME>
            <STATUS>10</STATUS>
            <REMARK1>20</REMARK1>
         </ROOT>
         <ROOT>
            <PRDHA>1015</PRDHA>
            <PRDHA_NAME>装修工具</PRDHA_NAME>
            <PRDHA_PARENT>10</PRDHA_PARENT>
            <STATUS>10</STATUS>
            <REMARK1>10</REMARK1>
         </ROOT>
         <ROOT>
            <PRDHA>101501</PRDHA>
            <PRDHA_NAME>电动电子工具</PRDHA_NAME>
            <PRDHA_PARENT>1015</PRDHA_PARENT>
            <STATUS>10</STATUS>
            <REMARK1>10</REMARK1>
            <REMARK2>3318</REMARK2>
            <REMARK3>6001</REMARK3>
         </ROOT>
         <ROOT>
            <PRDHA>101502</PRDHA>
            <PRDHA_NAME>非电动电子工具</PRDHA_NAME>
            <PRDHA_PARENT>1015</PRDHA_PARENT>
            <STATUS>10</STATUS>
            <REMARK1>10</REMARK1>
            <REMARK2>3318</REMARK2>
            <REMARK3>6001</REMARK3>
         </ROOT>
         <ROOT>
            <PRDHA>101503</PRDHA>
            <PRDHA_NAME>其它</PRDHA_NAME>
            <PRDHA_PARENT>1015</PRDHA_PARENT>
            <STATUS>10</STATUS>
            <REMARK1>10</REMARK1>
            <REMARK2>3318</REMARK2>
            <REMARK3>6001</REMARK3>
         </ROOT>
      </ns0:MT_MDM_MATC>
   </SOAP:Body>
</SOAP:Envelope>